Programming-Ruby.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-18 Fri 10:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ruby</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jonathan Arkell" />
<link href="https://fonts.googleapis.com/css?family=Inconsolata|Nixie+One|Taviraj:300,400" rel="stylesheet"><link href="./assets/styles/tufte-style.css" rel="stylesheet"></head>
<body>
<div id="preamble" class="status">
<menu class="top"><a href="index.html"> Index </a><a href="Emagician.html"> Emagician </a><a href="Emagician-Base.html"> Base </a><a href="Emagician-Install.html"> Install </a><a href="Emagician-Meta.html"> Meta </a><a href="Interface.html"> Interface </a><a href="Programming.html"> Programming </a><a href="Text.html"> Text </a><a href="Org-Grimoire.html"> Org </a><a href="Lamp.html"> Lamp </a><a href="Journal.html"> Journal </a><a href="Snippets.html"> Snippets </a></menu><menu class="ext"><a class="dotnet" href="http://www.jonnay.net/">jonnay.net</a><a class="github" href="https://github.com/jonnay/emagicians-starter-kit">Fork on Github</a></menu>
</div>
<div id="content">
<h1 class="title">Ruby</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org323a0af">1. Interface</a>
<ul>
<li><a href="#orge737da7">1.1. Completion</a></li>
</ul>
</li>
<li><a href="#org773e21e">2. Tools</a>
<ul>
<li><a href="#orgcac2557">2.1. Bundler</a></li>
<li><a href="#org49f8d67">2.2. Rspec</a></li>
<li><a href="#org7681474">2.3. Yari</a>
<ul>
<li><a href="#org2ad5ae5">2.3.1. Making it work</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org394d630">3. Mode</a>
<ul>
<li><a href="#org4ecd5eb">3.1. Ruby Block mode</a></li>
<li><a href="#org95c52ba">3.2. Rinari</a></li>
<li><a href="#org2c643cf">3.3. Robe</a></li>
<li><a href="#org1db8d9f">3.4. Mode setup</a></li>
</ul>
</li>
<li><a href="#orgc9a99eb">4. Environment</a>
<ul>
<li><a href="#org33e45f5">4.1. Add RBEnv path&#xa0;&#xa0;&#xa0;<span class="tag"><span class="disabled">disabled</span></span></a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org323a0af" class="outline-2">
<h2 id="org323a0af"><span class="section-number-2">1</span> Interface</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge737da7" class="outline-3">
<h3 id="orge737da7"><span class="section-number-3">1.1</span> Completion</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">company-inf-ruby</span>)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org773e21e" class="outline-2">
<h2 id="org773e21e"><span class="section-number-2">2</span> Tools</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgcac2557" class="outline-3">
<h3 id="orgcac2557"><span class="section-number-3">2.1</span> Bundler</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">bundler</span>
  <span class="org-builtin">:load-path</span> <span class="org-string">"~/projects/emacs/bundler.el"</span>)
</code></pre>
</div>
</div>
<div id="outline-container-org49f8d67" class="outline-3">
<h3 id="org49f8d67"><span class="section-number-3">2.2</span> Rspec</h3>
<div class="outline-text-3" id="text-2-2">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">rspec-mode</span>)
</code></pre>
</div>
</div>
<div id="outline-container-org7681474" class="outline-3">
<h3 id="org7681474"><span class="section-number-3">2.3</span> Yari</h3>
<div class="outline-text-3" id="text-2-3">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">yari</span>)
</code></pre>
</div>
<div id="outline-container-org2ad5ae5" class="outline-4">
<h4 id="org2ad5ae5"><span class="section-number-4">2.3.1</span> Making it work</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Get the base ruby documentation here
</p>
<pre class="code"><code>gem install rdoc-data
rdoc-data --install
</code></pre>

<p>
This gets all the rdoc for your installed gems
</p>
<pre class="code"><code>gem rdoc --all --ri
</code></pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org394d630" class="outline-2">
<h2 id="org394d630"><span class="section-number-2">3</span> Mode</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org4ecd5eb" class="outline-3">
<h3 id="org4ecd5eb"><span class="section-number-3">3.1</span> Ruby Block mode</h3>
<div class="outline-text-3" id="text-3-1">
<p>
This is gone?!?
</p>
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">ruby-block</span>
  <span class="org-builtin">:diminish</span> <span class="org-string">"[R] "</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> ruby-block-highlight-toggle t)
  <span class="org-builtin">:config</span>)
</code></pre>
</div>
</div>
<div id="outline-container-org95c52ba" class="outline-3">
<h3 id="org95c52ba"><span class="section-number-3">3.2</span> Rinari</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Rinari Is Not A Rails Ide.  ESPRYGAA!  (Emagicians Starter Pack Rejects Your Goofy Acronym Assertion!)
</p>

<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">rinari</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:diminish</span> <span class="org-string">"&#128645; "</span>)
</code></pre>
</div>
</div>
<div id="outline-container-org2c643cf" class="outline-3">
<h3 id="org2c643cf"><span class="section-number-3">3.3</span> Robe</h3>
<div class="outline-text-3" id="text-3-3">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">robe</span>
  <span class="org-builtin">:ensure</span> t)
</code></pre>
</div>
</div>

<div id="outline-container-org1db8d9f" class="outline-3">
<h3 id="org1db8d9f"><span class="section-number-3">3.4</span> Mode setup</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Thanks to the emacs starter kit classic for the list of ode files list. <label for="1" class="margin-toggle sidenote-number"></label><input type="checkbox" id="1" class="margin-toggle"/><span class="sidenote">
<a href="https://github.com/technomancy/emacs-starter-kit/blob/v2/modules/starter-kit-ruby.el">https://github.com/technomancy/emacs-starter-kit/blob/v2/modules/starter-kit-ruby.el</a>
</span>
</p>

<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">ruby-mode</span>
  <span class="org-builtin">:interpreter</span> <span class="org-string">"ruby"</span>
  <span class="org-builtin">:mode</span> 
  ((<span class="org-string">"\\.rake$"</span> . ruby-mode)
   (<span class="org-string">"\\.task$"</span> . ruby-mode)
   (<span class="org-string">"\\.thor$"</span> . ruby-mode)
   (<span class="org-string">"\\.gemspec$"</span> . ruby-mode)
   (<span class="org-string">"\\.rb$"</span> . ruby-mode)
   (<span class="org-string">"\\.ru$"</span> . ruby-mode)
   (<span class="org-string">"Rakefile$"</span> . ruby-mode)
   (<span class="org-string">"Thorfile$"</span> . ruby-mode)
   (<span class="org-string">"Gemfile$"</span> . ruby-mode)
   (<span class="org-string">"Capfile$"</span> . ruby-mode)
   (<span class="org-string">"Vagrantfile$"</span> . ruby-mode))
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">use-package</span> <span class="org-constant">ruby-tools</span>)
  (<span class="org-keyword">emagician/minor-in-major-mode</span> ruby-tools-mode ruby-mode-hook))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-orgc9a99eb" class="outline-2">
<h2 id="orgc9a99eb"><span class="section-number-2">4</span> Environment</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org33e45f5" class="outline-3">
<h3 id="org33e45f5"><span class="section-number-3">4.1</span> Add RBEnv path&#xa0;&#xa0;&#xa0;<span class="tag"><span class="disabled">disabled</span></span></h3>
<div class="outline-text-3" id="text-4-1">
<p>
This used to be required to make rbenv work, but not any more. 
</p>
<pre class="code"><code>(emagician/add-to-path (concat (getenv <span class="org-string">"HOME"</span>) <span class="org-string">"/.rbenv/shims"</span>) t)
</code></pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://github.com/technomancy/emacs-starter-kit/blob/v2/modules/starter-kit-ruby.el">https://github.com/technomancy/emacs-starter-kit/blob/v2/modules/starter-kit-ruby.el</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Jonathan Arkell</p>
<p class="date">Created: 2018-05-18 Fri 10:30</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
